# Программа, що перетворює градуси Цельсія на градуси Фаренгейтна
print("Привіт, ця программа допоможе тобі перевести градуси Цельсія у Фаренгейта")

while True:
    try:
        C = float(input('Введіть температуру у градусах Цельсія: '))
        print(f"Температура, що ви ввели: {C}")
        break
    except ValueError:
        print("Вводити можна лише число!")

while True:
    if C <= -273.15:
        print("Error: температура нижче абсолютного нуля(-273.15)")
        C = input("Введіть іншу температуру!")
    else:
        print("Чудово! Оброблюєио ваш запит...")
        break
    
F = (C * 9/5) + 32
print(f"{C} градусів Цельсію, дорівнюють {F} градусам Фаренгейта")
print('Дякую за увагу!')